Documents/ВыдачаКормаСписком.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВыдачаКормаСписком</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиРасходников</xr:Item>
				<xr:Item>InformationRegister.ГрафикПолученияКормаПодопечными</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Расходники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Кошка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Кошки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РационКормления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РационКормления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПриемаПищи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расходник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Расходники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоНаПорцию</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>9</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/РационыКормленияПодопечных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РационыКормленияПодопечных</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РационКормления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РационКормления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Кошка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/РационКормления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>РационКормления</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Составитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставРациона</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерПриемаПищи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расходник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Расходники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоНаПорцию</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВыдачи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ВыдачаКормаСписком/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура РасходникиКошкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Расходники.ТекущиеДанные;
	
	РационКормленияКошки = РационКормленияКошки(Объект.Дата, ТекущиеДанные.Кошка);
	Если РационКормленияКошки = Неопределено Тогда
		ТекстОшибки = СтрШаблон("Не установлен рацион кормления для кошки %1!", ТекущиеДанные.Кошка);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.РационКормления = РационКормленияКошки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РационКормленияКошки(Дата, Кошка)
	
	РационКормления = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РационыКормленияПодопечныхСрезПоследних.РационКормления КАК РационКормления
		|ИЗ
		|	РегистрСведений.РационыКормленияПодопечных.СрезПоследних(&Период, Кошка = &Кошка) КАК РационыКормленияПодопечныхСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Кошка", Кошка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		РационКормления = Выборка.РационКормления;
	КонецЕсли;
	
	Возврат РационКормления;
	
КонецФункции

&НаКлиенте
Процедура РасходникиНомерПриемаПищиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Расходники.ТекущиеДанные;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.РационКормления) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеПриемаПищи = ДанныеПриемаПищи(ТекущиеДанные.РационКормления, ТекущиеДанные.НомерПриемаПищи);
	
	Если НЕ ЗначениеЗаполнено(ДанныеПриемаПищи.Расходник) Тогда
		ТекстОшибки = "По № приема пищи не найдены данные в рационе!";
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Расходник          = ДанныеПриемаПищи.Расходник;
	ТекущиеДанные.ЕдиницаИзмерения   = ДанныеПриемаПищи.ЕдиницаИзмерения;
	ТекущиеДанные.КоличествоНаПорцию = ДанныеПриемаПищи.КоличествоНаПорцию;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеПриемаПищи(РационКормления, НомерПриемаПищи)
	
	ДанныеПриемаПищи = Новый Структура("Расходник,ЕдиницаИзмерения,КоличествоНаПорцию");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РационКормленияСоставРациона.Расходник КАК Расходник,
		|	РационКормленияСоставРациона.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	РационКормленияСоставРациона.КоличествоНаПорцию КАК КоличествоНаПорцию
		|ИЗ
		|	Справочник.РационКормления.СоставРациона КАК РационКормленияСоставРациона
		|ГДЕ
		|	РационКормленияСоставРациона.Ссылка = &Ссылка
		|	И РационКормленияСоставРациона.НомерПриемаПищи = &НомерПриемаПищи";
	
	Запрос.УстановитьПараметр("НомерПриемаПищи", НомерПриемаПищи);
	Запрос.УстановитьПараметр("Ссылка", РационКормления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДанныеПриемаПищи.Расходник          = Выборка.Расходник;
		ДанныеПриемаПищи.ЕдиницаИзмерения   = Выборка.ЕдиницаИзмерения;
		ДанныеПриемаПищи.КоличествоНаПорцию = Выборка.КоличествоНаПорцию;
	КонецЕсли;
	
	Возврат ДанныеПриемаПищи;

КонецФункции
